--[[
			================================
			================================
			================================
			================================
			======BB库详解之utils.lua=======
			================================
			================================
			================================
			===========================By.羽
]]

require("bblibs.utils")
--[[
	格式化输出
	参数1:输出的格式类型,具体参数参考lua手册
	参数2:传入的字符串
]]
--以ASCII码输出
sysLogFmt('%c',90)	--Z

--任意输出,不支持输出数组
sysLogLst('HELLO!!!','我叫羽','!!!!')	--输出 HELLO!!!  我叫羽  !!!! 
sysLogLst({id=1,name="羽"})	--输出  table: 0x171f8c90 

--点击
tap(100,100)

--模拟滑动操作，从点(x1, y1)划到到(x2, y2)
swip(100,200,100,500)

--[[
		多点颜色对比
		参数1:table类型,table.x,table.y,table.color
		参数2:对比颜色精度,默认90
		参数3:是否使用keepScreen,默认false
]]
local color = {
	x={100,200,300},
	y={100,200,300},
	color={0xff,0xee,0x2f3}
}
cmpColor(color,95,true)
